yii2/basic/widgets/Balance.php

    public function run()
    {
        $model = UsersEntity::findOne(['id' => \Yii::$app->user->id]);
---
SELECT * FROM `users` WHERE `id`=10