yii2/basic/views/users/process.php

SELECT * FROM `users` WHERE `id`='10'
SELECT * FROM `users` WHERE `id`='3'
---
 * @var TransfersEntity $model
 */

$fromUser = UsersEntity::findOne(['id' => $model->from_user_id]);

$toUser = UsersEntity::findOne(['id' => $model->to_user_id]);

UPDATE `users` SET `balance`='2112' WHERE id = '1'
UPDATE `users` SET `balance`='-800' WHERE id = '10'
---
    $transaction = $db->beginTransaction();
    try {

        $db->createCommand()
            ->update('{{%users}}', ['balance' => $fromUser->balance - $model->amount], 'id = :id', [':id' => $model->from_user_id])
            ->execute();

        $db->createCommand()
            ->update('{{%users}}', ['balance' => $toUser->balance + $model->amount], 'id = :id', [':id' => $model->to_user_id])
            ->execute();