yii2/basic/models/LoginForm.php

    public function getUser(): UsersEntity
    {
//        $this->user = User::findByUsername($this->nickname);

            $user = UsersEntity::find()->where(['nickname' => $this->nickname])->one();
            if(!$user){
                $user = new UsersEntity();
                $user->nickname = $this->nickname;
                $user->save() ?
---
INSERT INTO `users` (`nickname`) VALUES ('Irina')