yii2/basic/models/User.php

    public static function findIdentity($id): ?self
    {
        return self::findOne($id);
---
SELECT * FROM `users` WHERE `id`=10